package main

import "fmt"

func main() {
	var x1 int8 = 34   // 8비트(1바이트) 정수 // 00100010
	var x2 int16 = 34  // 16비트(2바이트) 정수 // 00000000 00100010
	var x3 uint8 = 34  // 부호 없는 8비트(1바이트) 정수 // 00100010
	var x4 uint16 = 34 // 부호 없는 16비트(2바이트) 정수 // 00000000 00100010

	fmt.Printf("^%d = %5d, \t %08b\n", x1, ^x1, uint8(^x1))   // ^34 =   -35,     11011101
	fmt.Printf("^%d = %5d, \t %08b\n", x1, ^x1, ^x1)          // ^34 =   -35,     -0100011 // -를 붙이고 양의 2진수로 표현
	fmt.Printf("^%d = %5d, \t %016b\n", x2, ^x2, uint16(^x2)) // ^34 =   -35,     1111111111011101
	fmt.Printf("^%d = %5d, \t %08b\n", x3, ^x3, uint8(^x3))   // ^34 =   221,     11011101
	fmt.Printf("^%d = %5d, \t %016b\n", x4, ^x4, uint16(^x4)) // ^34 = 65501,     1111111111011101
}
